feilongfl/hal_artery/at32f43x/drivers/src/at32f43x_usb.c
#ifdef OTGFS_USB_HOST
/**
  * @brief  usb port power on
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  *         - OTG2_GLOBAL
  * @param  state: state (TRUE or FALSE)
  * @retval none
  */
void usb_port_power_on(otg_global_type *usbx, confirm_state state)
{
  otg_host_type *usb_host = OTG_HOST(usbx);
  uint32_t hprt_val = usb_host->hprt;

  hprt_val &= ~(USB_OTG_HPRT_PRTENA | USB_OTG_HPRT_PRTENCHNG |
               USB_OTG_HPRT_PRTOVRCACT | USB_OTG_HPRT_PRTCONDET);

  if(state == TRUE)
  {
    usb_host->hprt = hprt_val | USB_OTG_HPRT_PRTPWR;
  }
  else
  {
    usb_host->hprt = hprt_val & (~USB_OTG_HPRT_PRTPWR);
  }
}

/**
  * @brief  get current frame number
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  *         - OTG2_GLOBAL
  * @retval none
  */
uint32_t usbh_get_frame(otg_global_type *usbx)
{
  otg_host_type *usb_host = OTG_HOST(usbx);
  return usb_host->hfnum & 0xFFFF;
}

/**
  * @brief  enable one host channel
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  *         - OTG2_GLOBAL
  * @param  chn: host channel number
  * @param  ept_num: devvice endpoint number
  * @param  dev_address: device address
  * @param  type: channel transfer type
  *         this parameter can be one of the following values:
  *         - EPT_CONTROL_TYPE
  *         - EPT_BULK_TYPE
  *         - EPT_INT_TYPE
  *         - EPT_ISO_TYPE
  * @param  maxpacket: support max packe size for this channel
  * @param  speed: device speed
  *         this parameter can be one of the following values:
  *         - USB_PRTSPD_FULL_SPEED
  *         - USB_PRTSPD_LOW_SPEED
  * @retval none
  */
void usb_hc_enable(otg_global_type *usbx,
                   uint8_t chn,
                   uint8_t ept_num,
                   uint8_t dev_address,
                   uint8_t type,
                   uint16_t maxpacket,
                   uint8_t speed)
{
  otg_hchannel_type *hch = USB_CHL(usbx, chn);
  otg_host_type *usb_host = OTG_HOST(usbx);

  switch(type)
  {
    case EPT_CONTROL_TYPE:
    case EPT_BULK_TYPE:
      hch->hcintmsk |= USB_OTG_HC_XFERCM_INT | USB_OTG_HC_STALLM_INT |
                       USB_OTG_HC_XACTERRM_INT | USB_OTG_HC_NAKM_INT |
                       USB_OTG_HC_DTGLERRM_INT;
      if(ept_num & 0x80)
      {
        hch->hcintmsk_bit.bblerrmsk = TRUE;
      }
      break;
    case EPT_INT_TYPE:
      hch->hcintmsk |= USB_OTG_HC_XFERCM_INT | USB_OTG_HC_STALLM_INT |
                       USB_OTG_HC_XACTERRM_INT | USB_OTG_HC_NAKM_INT |
                       USB_OTG_HC_DTGLERRM_INT | USB_OTG_HC_FRMOVRRUN_INT;
      break;
    case EPT_ISO_TYPE:

      hch->hcintmsk |= USB_OTG_HC_XFERCM_INT | USB_OTG_HC_ACKM_INT |
                       USB_OTG_HC_FRMOVRRUN_INT;
      break;
  }
  usb_host->haintmsk |= 1 << chn;
  usbx->gintmsk_bit.hchintmsk = TRUE;

  hch->hcchar_bit.devaddr = dev_address;
  hch->hcchar_bit.eptnum = ept_num & 0x7F;
  hch->hcchar_bit.eptdir = (ept_num & 0x80)?1:0;
  hch->hcchar_bit.lspddev = (speed == USB_PRTSPD_LOW_SPEED)?1:0;
  hch->hcchar_bit.eptype = type;
  hch->hcchar_bit.mps = maxpacket;

  if(type == EPT_INT_TYPE)
  {
    hch->hcchar_bit.oddfrm = TRUE;
  }
}

/**
  * @brief  host read channel interrupt
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  *         - OTG2_GLOBAL
  * @retval interrupt flag
  */
uint32_t usb_hch_read_interrupt(otg_global_type *usbx)
{
  otg_host_type *usb_host = OTG_HOST(usbx);
  return usb_host->haint & 0xFFFF;
}

/**
  * @brief  disable host
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  *         - OTG2_GLOBAL
  * @retval none
  */
void usb_host_disable(otg_global_type *usbx)
{
  uint32_t i_index = 0, count = 0;
  otg_hchannel_type *hch;
  otg_host_type *usb_host = OTG_HOST(usbx);

  usbx->gahbcfg_bit.glbintmsk = FALSE;
  usb_flush_rx_fifo(usbx);
  usb_flush_tx_fifo(usbx, 0x10);

  for(i_index = 0; i_index < 16; i_index ++)
  {
    hch = USB_CHL(usbx, i_index);
    hch->hcchar_bit.chdis = TRUE;
    hch->hcchar_bit.chena = FALSE;
    hch->hcchar_bit.eptdir = 0;
  }

  for(i_index = 0; i_index < 16; i_index ++)
  {
    hch = USB_CHL(usbx, i_index);
    hch->hcchar_bit.chdis = TRUE;
    hch->hcchar_bit.chena = TRUE;
    hch->hcchar_bit.eptdir = 0;
    do
    {
      if(count ++ > 1000)
        break;
    }while(hch->hcchar_bit.chena);
  }
  usb_host->haint = 0xFFFFFFFF;
  usbx->gintsts = 0xFFFFFFFF;
  usbx->gahbcfg_bit.glbintmsk = TRUE;
}

/**
  * @brief  halt channel
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  *         - OTG2_GLOBAL
  * @param  chn: channel number
  * @retval none
  */
void usb_hch_halt(otg_global_type *usbx, uint8_t chn)
{
  uint32_t count = 0;
  otg_hchannel_type *usb_chh = USB_CHL(usbx, chn);
  otg_host_type *usb_host = OTG_HOST(usbx);

  /* endpoint type is control or bulk */
  if(usb_chh->hcchar_bit.eptype == EPT_CONTROL_TYPE ||
     usb_chh->hcchar_bit.eptype == EPT_BULK_TYPE)
  {
    usb_chh->hcchar_bit.chdis = TRUE;
    if((usbx->gnptxsts & 0xFFFF) == 0)
    {
      usb_chh->hcchar_bit.chena = FALSE;
      usb_chh->hcchar_bit.chena = TRUE;
      usb_chh->hcchar_bit.eptdir = 0;
      do
      {
        if(count ++ > 1000)
          break;
      }while(usb_chh->hcchar_bit.chena == SET);
    }
    else
    {
      usb_chh->hcchar_bit.chena = TRUE;
    }
  }
  else
  {
    usb_chh->hcchar_bit.chdis = TRUE;
    if((usb_host->hptxsts & 0xFFFF) == 0)
    {
      usb_chh->hcchar_bit.chena = FALSE;
      usb_chh->hcchar_bit.chena = TRUE;
      usb_chh->hcchar_bit.eptdir = 0;
      do
      {
        if(count ++ > 1000)
          break;
      }while(usb_chh->hcchar_bit.chena == SET);
    }
    else
    {
      usb_chh->hcchar_bit.chena = TRUE;
    }
  }
}
/**
  * @brief  select full or low speed clock
  * @param  usbx: to select the otgfs peripheral.
  *         this parameter can be one of the following values:
  *         - OTG1_GLOBAL
  *         - OTG2_GLOBAL
  * @param  clk: clock frequency
  * @retval none
  */
void usbh_fsls_clksel(otg_global_type *usbx, uint8_t clk)
{
  otg_host_type *usb_host = OTG_HOST(usbx);

  usb_host->hcfg_bit.fslspclksel = clk;
  if(clk == USB_HCFG_CLK_6M)
  {
    usb_host->hfir = 6000;
  }
  else
  {
    usb_host->hfir = 48000;
  }
}
#endif


/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
